---
kind: type
id: T:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface
source: html/72ef40eb-20ae-d7ef-0ab5-8c52ddd4b813.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface

Analytical surface.
 The collection of analytic openings belonging to this analytical parent surface

## Syntax (C#)
```csharp
public class EnergyAnalysisSurface : Element
```